package com.yandex.diplom2;

public class OrderTest {
    /*
     * Изменение данных пользователя:
        с авторизацией,
        без авторизации,
        Для обеих ситуаций нужно проверить, что любое поле можно изменить. Для неавторизованного пользователя — ещё и то, что система вернёт ошибку.

        Создание заказа:
            с авторизацией,
            без авторизации,
            с ингредиентами,
            без ингредиентов,
            с неверным хешем ингредиентов.

        Получение заказов конкретного пользователя:
            авторизованный пользователь,
            неавторизованный пользователь.
     */
}
